In [1]:
import pandas as pd

In [2]:

# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)

In [3]:
df.head()

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [14]:
df.iloc[0:1,-1:]

  Qualification
0           Msc

In [22]:
for i, j in df.iterrows():
    print(i,j)

0 Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object
1 Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Name: 1, dtype: object
2 Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Name: 2, dtype: object
3 Name                Anuj
Age                   32
Address          Kannauj
Qualification        Phd
Name: 3, dtype: object

In [33]:
data = list(df)
for i in  data:
    print(df[i][0:])

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object
0    27
1    24
2    22
3    32
Name: Age, dtype: int64
0        Delhi
1       Kanpur
2    Allahabad
3      Kannauj
Name: Address, dtype: object
0    Msc
1     MA
2    MCA
3    Phd
Name: Qualification, dtype: object

## dataframe insert

In [3]:
df.head()

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [4]:
df1 = df.copy()

In [5]:
df.insert(1,"random",'Any')

In [7]:
df1['random'] = 'Any'

In [8]:
df1.head()

     Name  Age    Address Qualification random
0     Jai   27      Delhi           Msc    Any
1  Princi   24     Kanpur            MA    Any
2  Gaurav   22  Allahabad           MCA    Any
3    Anuj   32    Kannauj           Phd    Any